JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_trdc.h
/* Common definitions for MBC/MRC configuration */
/*!
 * @brief Memory access control configuration for MBC/MRC.
 */
typedef struct _trdc_memory_access_control_config
{
    uint32_t nonsecureUsrX : 1U;  /*!< Allow nonsecure user execute access. */
    uint32_t nonsecureUsrW : 1U;  /*!< Allow nonsecure user write access. */
    uint32_t nonsecureUsrR : 1U;  /*!< Allow nonsecure user read access. */
    uint32_t : 1U;                /*!< Reserved. */
    uint32_t nonsecurePrivX : 1U; /*!< Allow nonsecure privilege execute access. */
    uint32_t nonsecurePrivW : 1U; /*!< Allow nonsecure privilege write access. */
    uint32_t nonsecurePrivR : 1U; /*!< Allow nonsecure privilege read access. */
    uint32_t : 1U;                /*!< Reserved. */
    uint32_t secureUsrX : 1U;     /*!< Allow secure user execute access. */
    uint32_t secureUsrW : 1U;     /*!< Allow secure user write access. */
    uint32_t secureUsrR : 1U;     /*!< Allow secure user read access. */
    uint32_t : 1U;                /*!< Reserved. */
    uint32_t securePrivX : 1U;    /*!< Allownsecure privilege execute access. */
    uint32_t securePrivW : 1U;    /*!< Allownsecure privilege write access. */
    uint32_t securePrivR : 1U;    /*!< Allownsecure privilege read access. */
    uint32_t : 16U;               /*!< Reserved. */
    uint32_t lock : 1U; /*!< Lock the configuration until next reset, only apply to access control register 0. */
} trdc_memory_access_control_config_t;

/*! @brief The region descriptor enumeration, used to form a mask to set/clear the NSE bits for one or several regions.
 */
enum _trdc_region_descriptor
{
    kTRDC_RegionDescriptor0  = (1U << 0U),  /*!< Region descriptor 0. */
    kTRDC_RegionDescriptor1  = (1U << 1U),  /*!< Region descriptor 1. */
    kTRDC_RegionDescriptor2  = (1U << 2U),  /*!< Region descriptor 2. */
    kTRDC_RegionDescriptor3  = (1U << 3U),  /*!< Region descriptor 3. */
    kTRDC_RegionDescriptor4  = (1U << 4U),  /*!< Region descriptor 4. */
    kTRDC_RegionDescriptor5  = (1U << 5U),  /*!< Region descriptor 5. */
    kTRDC_RegionDescriptor6  = (1U << 6U),  /*!< Region descriptor 6. */
    kTRDC_RegionDescriptor7  = (1U << 7U),  /*!< Region descriptor 7. */
    kTRDC_RegionDescriptor8  = (1U << 8U),  /*!< Region descriptor 8. */
    kTRDC_RegionDescriptor9  = (1U << 9U),  /*!< Region descriptor 9. */
    kTRDC_RegionDescriptor10 = (1U << 10U), /*!< Region descriptor 10. */
    kTRDC_RegionDescriptor11 = (1U << 11U), /*!< Region descriptor 11. */
    kTRDC_RegionDescriptor12 = (1U << 12U), /*!< Region descriptor 12. */
    kTRDC_RegionDescriptor13 = (1U << 13U), /*!< Region descriptor 13. */
    kTRDC_RegionDescriptor14 = (1U << 14U), /*!< Region descriptor 14. */
    kTRDC_RegionDescriptor15 = (1U << 15U), /*!< Region descriptor 15. */
};

/* MRC configuration definitions */
/*! @brief The MRC domain enumeration, used to form a mask to enable/disable the update or clear all NSE bits of one or
 * several domains. */
enum _trdc_MRC_domain
{
    kTRDC_MrcDomain0  = (1U << 0U),  /*!< Domain 0. */
    kTRDC_MrcDomain1  = (1U << 1U),  /*!< Domain 1. */
    kTRDC_MrcDomain2  = (1U << 2U),  /*!< Domain 2. */
    kTRDC_MrcDomain3  = (1U << 3U),  /*!< Domain 3. */
    kTRDC_MrcDomain4  = (1U << 4U),  /*!< Domain 4. */
    kTRDC_MrcDomain5  = (1U << 5U),  /*!< Domain 5. */
    kTRDC_MrcDomain6  = (1U << 6U),  /*!< Domain 6. */
    kTRDC_MrcDomain7  = (1U << 7U),  /*!< Domain 7. */
    kTRDC_MrcDomain8  = (1U << 8U),  /*!< Domain 8. */
    kTRDC_MrcDomain9  = (1U << 9U),  /*!< Domain 9. */
    kTRDC_MrcDomain10 = (1U << 10U), /*!< Domain 10. */
    kTRDC_MrcDomain11 = (1U << 11U), /*!< Domain 11. */
    kTRDC_MrcDomain12 = (1U << 12U), /*!< Domain 12. */
    kTRDC_MrcDomain13 = (1U << 13U), /*!< Domain 13. */
    kTRDC_MrcDomain14 = (1U << 14U), /*!< Domain 14. */
    kTRDC_MrcDomain15 = (1U << 15U), /*!< Domain 15. */
};

/*!
 * @brief The configuration of each region descriptor per domain per MRC instance.
 */
typedef struct _trdc_mrc_region_descriptor_config
{
    uint8_t memoryAccessControlSelect; /*!< Select one of the 8 access control policies for this region, for
                                                access cotrol policies see @ref trdc_memory_access_control_config_t. */
    uint32_t startAddr;                /*!< Physical start address. */
    bool valid;                        /*!< Lock the register. */
    bool nseEnable;                    /*!< Enable non-secure accesses and disable secure accesses. */
    uint32_t endAddr;                  /*!< Physical start address. */
    uint8_t mrcIdx;                    /*!< The index of the MRC for this configuration to take effect. */
    uint8_t domainIdx;                 /*!< The index of the domain for this configuration to take effect. */
    uint8_t regionIdx;                 /*!< The index of the region for this configuration to take effect. */
} trdc_mrc_region_descriptor_config_t;

/* MBC configuration definitions */
/*!
 * @brief The configuration of MBC NSE update.
 */
#if defined(FSL_FEATURE_TRDC_DOMAIN_COUNT) && (FSL_FEATURE_TRDC_DOMAIN_COUNT > 0x8U)
typedef struct _trdc_mbc_nse_update_config
{
    uint32_t autoIncrement : 1U; /*!< Whether to increment the word index after current word is updated using this
                                    configuration. */
    uint32_t : 1U;               /*!< Reserved. */
    uint32_t wordIdx : 4U;       /*!< MBC configuration word index to be updated. */
    uint32_t : 2U;               /*!< Reserved. */
    uint32_t memorySelect : 4U;  /*!< Bit mask of the selected memory to be updated. @ref _trdc_MBC_memory. */
    uint32_t : 4U;               /*!< Reserved. */
    uint32_t domianSelect : 16U; /*!< Bit mask of the selected domain to be updated. @ref _trdc_MBC_domain. */
} trdc_mbc_nse_update_config_t;
#else
typedef struct _trdc_mbc_nse_update_config
{
    uint32_t : 2U;               /*!< Reserved. */
    uint32_t wordIdx : 4U;       /*!< MBC configuration word index to be updated. */
    uint32_t : 2U;               /*!< Reserved. */
    uint32_t memorySelect : 4U;  /*!< Bit mask of the selected memory to be updated. @ref _trdc_MBC_memory. */
    uint32_t : 4U;               /*!< Reserved. */
    uint32_t domianSelect : 8U;  /*!< Bit mask of the selected domain to be updated. @ref _trdc_MBC_domain. */
    uint32_t : 7U;               /*!< Reserved. */
    uint32_t autoIncrement : 1U; /*!< Whether to increment the word index after current word is updated using this
                                    configuration. */
} trdc_mbc_nse_update_config_t;
#endif

/*! @brief The MBC domain enumeration, used to form a mask to enable/disable the update or clear NSE bits of one or
 * several domains. */
enum _trdc_MBC_domain
{
    kTRDC_MbcDomain0 = (1U << 0U), /*!< Domain 0. */
    kTRDC_MbcDomain1 = (1U << 1U), /*!< Domain 1. */
    kTRDC_MbcDomain2 = (1U << 2U), /*!< Domain 2. */
    kTRDC_MbcDomain3 = (1U << 3U), /*!< Domain 3. */
    kTRDC_MbcDomain4 = (1U << 4U), /*!< Domain 4. */
    kTRDC_MbcDomain5 = (1U << 5U), /*!< Domain 5. */
    kTRDC_MbcDomain6 = (1U << 6U), /*!< Domain 6. */
    kTRDC_MbcDomain7 = (1U << 7U), /*!< Domain 7. */
};

