JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_trdc.h
/*! @brief The MBC slave memory enumeration, used to form a mask to enable/disable the update or clear NSE bits of one
 * or several memory block. */
enum _trdc_MBC_memory
{
    kTRDC_MbcSlaveMemory0 = (1U << 0U), /*!< Memory 0. */
    kTRDC_MbcSlaveMemory1 = (1U << 1U), /*!< Memory 1. */
    kTRDC_MbcSlaveMemory2 = (1U << 2U), /*!< Memory 2. */
    kTRDC_MbcSlaveMemory3 = (1U << 3U), /*!< Memory 3. */
};

/*! @brief The MBC bit enumeration, used to form a mask to set/clear configured words' NSE. */
enum _trdc_MBC_bit
{
    kTRDC_MbcBit0  = (1U << 0U),  /*!< Bit 0. */
    kTRDC_MbcBit1  = (1U << 1U),  /*!< Bit 1. */
    kTRDC_MbcBit2  = (1U << 2U),  /*!< Bit 2. */
    kTRDC_MbcBit3  = (1U << 3U),  /*!< Bit 3. */
    kTRDC_MbcBit4  = (1U << 4U),  /*!< Bit 4. */
    kTRDC_MbcBit5  = (1U << 5U),  /*!< Bit 5. */
    kTRDC_MbcBit6  = (1U << 6U),  /*!< Bit 6. */
    kTRDC_MbcBit7  = (1U << 7U),  /*!< Bit 7. */
    kTRDC_MbcBit8  = (1U << 8U),  /*!< Bit 8. */
    kTRDC_MbcBit9  = (1U << 9U),  /*!< Bit 9. */
    kTRDC_MbcBit10 = (1U << 10U), /*!< Bit 10. */
    kTRDC_MbcBit11 = (1U << 11U), /*!< Bit 11. */
    kTRDC_MbcBit12 = (1U << 12U), /*!< Bit 12. */
    kTRDC_MbcBit13 = (1U << 13U), /*!< Bit 13. */
    kTRDC_MbcBit14 = (1U << 14U), /*!< Bit 14. */
    kTRDC_MbcBit15 = (1U << 15U), /*!< Bit 15. */
    kTRDC_MbcBit16 = (1U << 16U), /*!< Bit 16. */
    kTRDC_MbcBit17 = (1U << 17U), /*!< Bit 17. */
    kTRDC_MbcBit18 = (1U << 18U), /*!< Bit 18. */
    kTRDC_MbcBit19 = (1U << 19U), /*!< Bit 19. */
    kTRDC_MbcBit20 = (1U << 20U), /*!< Bit 20. */
    kTRDC_MbcBit21 = (1U << 21U), /*!< Bit 21. */
    kTRDC_MbcBit22 = (1U << 22U), /*!< Bit 22. */
    kTRDC_MbcBit23 = (1U << 23U), /*!< Bit 23. */
    kTRDC_MbcBit24 = (1U << 24U), /*!< Bit 24. */
    kTRDC_MbcBit25 = (1U << 25U), /*!< Bit 25. */
    kTRDC_MbcBit26 = (1U << 26U), /*!< Bit 26. */
    kTRDC_MbcBit27 = (1U << 27U), /*!< Bit 27. */
    kTRDC_MbcBit28 = (1U << 28U), /*!< Bit 28. */
    kTRDC_MbcBit29 = (1U << 29U), /*!< Bit 29. */
    kTRDC_MbcBit30 = (1U << 30U), /*!< Bit 30. */
    kTRDC_MbcBit31 = (1U << 31U), /*!< Bit 31. */
};

/*!
 * @brief The configuration of each memory block per domain per MBC instance.
 */
typedef struct _trdc_mbc_memory_block_config
{
    uint32_t memoryAccessControlSelect : 3U; /*!< Select one of the 8 access control policies for this memory block, for
                                                access cotrol policies see @ref trdc_memory_access_control_config_t. */
    uint32_t nseEnable : 1U;                 /*!< Enable non-secure accesses and disable secure accesses. */
    uint32_t mbcIdx : 4U;                    /*!< The index of the MBC for this configuration to take effect. */
    uint32_t domainIdx : 8U;                 /*!< The index of the domain for this configuration to take effect. */
    uint32_t slaveMemoryIdx : 8U; /*!< The index of the slave memory for this configuration to take effect. */
    uint32_t memoryBlockIdx : 8U; /*!< The index of the memory block for this configuration to take effect. */
} trdc_mbc_memory_block_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization and deinitialization
 * @{
 */
/*!
 * @brief Initializes the TRDC module.
 *
 * This function enables the TRDC clock.
 *
 * @param base TRDC peripheral base address.
 */
void TRDC_Init(TRDC_Type *base);

/*!
 * @brief De-initializes the TRDC module.
 *
 * This function disables the TRDC clock.
 *
 * @param base TRDC peripheral base address.
 */
void TRDC_Deinit(TRDC_Type *base);
/* @} */

/*!
 * @name Hardware configuration
 * @{
 */
/*!
 * @brief Gets the domain ID of the current bus master.
 *
 * @param base TRDC peripheral base address.
 * @return Domain ID of current bus master.
 */
static inline uint8_t TRDC_GetCurrentMasterDomainId(TRDC_Type *base)
{
    return (uint8_t)((base->TRDC_HWCFG1 & TRDC_TRDC_HWCFG1_DID_MASK) >> TRDC_TRDC_HWCFG1_DID_SHIFT);
}

/*!
 * @brief Gets the TRDC hardware configuration.
 *
 * This function gets the TRDC hardware configurations, including number of bus
 * masters, number of domains, number of MRCs and number of PACs.
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to the structure to get the configuration.
 */
void TRDC_GetHardwareConfig(TRDC_Type *base, trdc_hardware_config_t *config);
/* @} */

/*!
 * @name Master domain assignment
 * @{
 */
/*!
 * @brief Sets the TRDC DAC(Domain Assignment Controllers) global valid.
 *
 * Once enabled, it will remain enabled until next reset.
 *
 * @param base TRDC peripheral base address.
 */
static inline void TRDC_SetDacGlobalValid(TRDC_Type *base)
{
    base->TRDC_CR |= TRDC_TRDC_CR_GVLDM_MASK;
}

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * @brief Locks the bus master domain assignment register.
 *
 * This function locks the master domain assignment. After it is locked, the register can't be changed
 * until next reset.
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure, refer to trdcx_master_t in processor header file, x is trdc instance.
 * @param regNum Which register to configure, processor master can have more than one register for the MDAC
 * configuration.
 * @param assignIndex Which assignment register to lock.
 */
static inline void TRDC_LockMasterDomainAssignment(TRDC_Type *base, uint8_t master, uint8_t regNum)
#else
/*!
 * @brief Locks the bus master domain assignment register.
 *
 * This function locks the master domain assignment. After it is locked, the register can't be changed
 * until next reset.
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure.
 * @param assignIndex Which assignment register to lock.
 */
static inline void TRDC_LockMasterDomainAssignment(TRDC_Type *base, uint8_t master)
#endif
{
    /* Make sure in the master range. */
    assert((uint32_t)master < ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMSTR_MASK) >> TRDC_TRDC_HWCFG0_NMSTR_SHIFT));
#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    if (0U == (base->DACFG[master] & TRDC_DACFG_NCM_MASK))
    {
        base->MDA_DFMT0[master].MDA_W_DFMT0[regNum] |= TRDC_MDA_W_DFMT0_LK1_MASK;
    }
    else
    {
        base->MDA_DFMT1[master].MDA_W_DFMT1[0] |= TRDC_MDA_W_DFMT1_LK1_MASK;
    }
#else
    /* Non-processor master */
    if ((uint8_t)master != 0U)
    {
        base->MDA_W0_DFMT1[(uint8_t)(master - 1U)].MDA_W0_x_DFMT1 |= TRDC_MDA_W0_x_DFMT1_LK1_MASK;
    }
    /* Processor master */
    else
    {
        base->MDA_W0_0_DFMT0 |= TRDC_MDA_W0_0_DFMT0_LK1_MASK;
    }
#endif
}

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * @brief Sets the master domain assignment as valid or invalid.
 *
 * This function sets the master domain assignment as valid or invalid.
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure.
 * @param regNum Which register to configure, processor master can have more than one register for the MDAC
 * configuration.
 * @param assignIndex Index for the domain assignment register.
 * @param valid True to set valid, false to set invalid.
 */
static inline void TRDC_SetMasterDomainAssignmentValid(TRDC_Type *base, uint8_t master, uint8_t regNum, bool valid)
#else
/*!
 * @brief Sets the master domain assignment as valid or invalid.
 *
 * This function sets the master domain assignment as valid or invalid.
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure.
 * @param assignIndex Index for the domain assignment register.
 * @param valid True to set valid, false to set invalid.
 */
static inline void TRDC_SetMasterDomainAssignmentValid(TRDC_Type *base, uint8_t master, bool valid)
#endif
{
    /* Make sure in the master range. */
    assert((uint32_t)master < ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMSTR_MASK) >> TRDC_TRDC_HWCFG0_NMSTR_SHIFT));
#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    if (valid)
    {
        if (0U == (base->DACFG[master] & TRDC_DACFG_NCM_MASK))
        {
            base->MDA_DFMT0[master].MDA_W_DFMT0[regNum] |= TRDC_MDA_W_DFMT0_VLD_MASK;
        }
        else
        {
            base->MDA_DFMT1[master].MDA_W_DFMT1[0] |= TRDC_MDA_W_DFMT1_VLD_MASK;
        }
    }
    else
    {
        if (0U == (base->DACFG[master] & TRDC_DACFG_NCM_MASK))
        {
            base->MDA_DFMT0[master].MDA_W_DFMT0[regNum] &= ~TRDC_MDA_W_DFMT0_VLD_MASK;
        }
        else
        {
            base->MDA_DFMT1[master].MDA_W_DFMT1[0] &= ~TRDC_MDA_W_DFMT1_VLD_MASK;
        }
    }
#else
    /* Non-processor master */
    if ((uint8_t)master != 0U)
    {
        if (valid)
        {
            base->MDA_W0_DFMT1[(uint8_t)(master - 1U)].MDA_W0_x_DFMT1 |= TRDC_MDA_W0_x_DFMT1_VLD_MASK;
        }
        else
        {
            base->MDA_W0_DFMT1[(uint8_t)(master - 1U)].MDA_W0_x_DFMT1 &= ~TRDC_MDA_W0_x_DFMT1_VLD_MASK;
        }
    }
    /* Processor master */
    else
    {
        if (valid)
        {
            base->MDA_W0_0_DFMT0 |= TRDC_MDA_W0_0_DFMT0_VLD_MASK;
        }
        else
        {
            base->MDA_W0_0_DFMT0 &= ~TRDC_MDA_W0_0_DFMT0_VLD_MASK;
        }
    }
#endif
}

/*!
 * @brief Gets the default master domain assignment for the processor bus master.
 *
 * This function gets the default master domain assignment for the processor bus master.
 * It should only be used for the processor bus masters, such as CORE0. This function
 * sets the assignment as follows:
 *
 * @code
 * assignment->domainId           = 0U;
 * assignment->domainIdSelect     = kTRDC_DidMda;
 * assignment->lock               = 0U;
 * @endcode
 *
 * @param domainAssignment Pointer to the assignment structure.
 */
void TRDC_GetDefaultProcessorDomainAssignment(trdc_processor_domain_assignment_t *domainAssignment);

/*!
 * @brief Gets the default master domain assignment for non-processor bus master.
 *
 * This function gets the default master domain assignment for non-processor bus master.
 * It should only be used for the non-processor bus masters, such as DMA. This function
 * sets the assignment as follows:
 *
 * @code
 * assignment->domainId            = 0U;
 * assignment->privilegeAttr       = kTRDC_ForceUser;
 * assignment->secureAttr       = kTRDC_ForceSecure;
 * assignment->bypassDomainId      = 0U;
 * assignment->lock                = 0U;
 * @endcode
 *
 * @param domainAssignment Pointer to the assignment structure.
 */
void TRDC_GetDefaultNonProcessorDomainAssignment(trdc_non_processor_domain_assignment_t *domainAssignment);

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * @brief Sets the processor bus master domain assignment.
 *
 * This function sets the processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for core 0.
 *
 * @code
 * trdc_processor_domain_assignment_t processorAssignment;
 *
 * TRDC_GetDefaultProcessorDomainAssignment(&processorAssignment);
 *
 * processorAssignment.domainId = 0;
 * processorAssignment.xxx      = xxx;
 * TRDC_SetMasterDomainAssignment(TRDC, &processorAssignment);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure, refer to trdc_master_t in processor header file.
 * @param regNum Which register to configure, processor master can have more than one register for the MDAC
 * configuration.
 * @param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetProcessorDomainAssignment(TRDC_Type *base,
                                       uint8_t master,
                                       uint8_t regNum,
                                       const trdc_processor_domain_assignment_t *domainAssignment);
#else
/*!
 * @brief Sets the processor bus master domain assignment.
 *
 * This function sets the processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for core 0.
 *
 * @code
 * trdc_processor_domain_assignment_t processorAssignment;
 *
 * TRDC_GetDefaultProcessorDomainAssignment(&processorAssignment);
 *
 * processorAssignment.domainId = 0;
 * processorAssignment.xxx      = xxx;
 * TRDC_SetMasterDomainAssignment(TRDC, &processorAssignment);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetProcessorDomainAssignment(TRDC_Type *base, const trdc_processor_domain_assignment_t *domainAssignment);
#endif

/*!
 * @brief Sets the non-processor bus master domain assignment.
 *
 * This function sets the non-processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for DMA0.
 * @code
 * trdc_non_processor_domain_assignment_t nonProcessorAssignment;
 *
 * TRDC_GetDefaultNonProcessorDomainAssignment(&nonProcessorAssignment);
 * nonProcessorAssignment.domainId = 1;
 * nonProcessorAssignment.xxx      = xxx;
 *
 * TRDC_SetMasterDomainAssignment(TRDC, kTrdcMasterDma0, 0U, &nonProcessorAssignment);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param master Which master to configure, refer to trdc_master_t in processor header file.
 * @param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetNonProcessorDomainAssignment(TRDC_Type *base,
                                          uint8_t master,
                                          const trdc_non_processor_domain_assignment_t *domainAssignment);

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * @brief Gets the bit map of the bus master(s) that is(are) sourcing a PID register.
 *
 * This function sets the non-processor master domain assignment as valid.
 *
 * @param base TRDC peripheral base address.
 * @return the bit map of the master(s). Bit 1 sets indicates bus master 1.
 */
static inline uint64_t TRDC_GetActiveMasterPidMap(TRDC_Type *base)
{
    return ((uint64_t)base->TRDC_HWCFG3 << 32U) | (uint64_t)base->TRDC_HWCFG2;
}
#endif

/* @} */

/*!
 * @name TZ-M congiguration
 * @{
 */
/*!
 * @brief Gets the default IDAU(Implementation-Defined Attribution Unit) configuration.
 *
 * @code
 * config->lockSecureVTOR    = false;
 * config->lockNonsecureVTOR = false;
 * config->lockSecureMPU     = false;
 * config->lockNonsecureMPU  = false;
 * config->lockSAU           = false;
 * @endcode
 *
 * @param domainAssignment Pointer to the configuration structure.
 */
void TRDC_GetDefaultIDAUConfig(trdc_idau_config_t *idauConfiguration);

/*!
 * @brief Sets the IDAU(Implementation-Defined Attribution Unit) control configuration.
 *
 * Example: Lock the secure and non-secure MPU registers.
 *
 * @code
 * trdc_idau_config_t idauConfiguration;
 *
 * TRDC_GetDefaultIDAUConfig(&idauConfiguration);
 *
 * idauConfiguration.lockSecureMPU = true;
 * idauConfiguration.lockNonsecureMPU      = true;
 * TRDC_SetIDAU(TRDC, &idauConfiguration);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param domainAssignment Pointer to the configuration structure.
 */
void TRDC_SetIDAU(TRDC_Type *base, const trdc_idau_config_t *idauConfiguration);
/* @} */

/*!
 * @name FLW(Flash Logical Window) configuration
 * @{
 */
/*!
 * @brief Enables/disables the FLW(flash logical window) function.
 *
 * @param base TRDC peripheral base address.
 * @param enable True to enable, false to disable.
 */
static inline void TRDC_EnableFlashLogicalWindow(TRDC_Type *base, bool enable)
{
    if (enable)
    {
        base->TRDC_FLW_CTL |= TRDC_TRDC_FLW_CTL_V_MASK;
    }
    else
    {
        base->TRDC_FLW_CTL &= ~TRDC_TRDC_FLW_CTL_V_MASK;
    }
}

/*!
 * @brief Locks FLW registers. Once locked the registers can noy be updated until next reset.
 *
 * @param base TRDC peripheral base address.
 */
static inline void TRDC_LockFlashLogicalWindow(TRDC_Type *base)
{
    base->TRDC_FLW_CTL |= TRDC_TRDC_FLW_CTL_LK_MASK;
}

/*!
 * @brief Gets the FLW physical base address.
 *
 * @param base TRDC peripheral base address.
 * @return Physical address of the FLW function.
 */
static inline uint32_t TRDC_GetFlashLogicalWindowPbase(TRDC_Type *base)
{
    return base->TRDC_FLW_PBASE;
}

/*!
 * @brief Sets the FLW size.
 *
 * @param base TRDC peripheral base address.
 * @param size Size of the FLW in unit of 32k bytes.
 */
static inline void TRDC_GetSetFlashLogicalWindowSize(TRDC_Type *base, uint16_t size)
{
    base->TRDC_FLW_BCNT = size;
}

/*!
 * @brief Gets the default FLW(Flsh Logical Window) configuration.
 *
 * @code
 * config->blockCount    = false;
 * config->arrayBaseAddr = false;
 * config->lock     = false;
 * config->enable  = false;
 * @endcode
 *
 * @param flwConfiguration Pointer to the configuration structure.
 */
void TRDC_GetDefaultFlashLogicalWindowConfig(trdc_flw_config_t *flwConfiguration);

/*!
 * @brief Sets the FLW function's configuration.
 *
 * @code
 * trdc_flw_config_t flwConfiguration;
 *
 * TRDC_GetDefaultIDAUConfig(&flwConfiguration);
 *
 * flwConfiguration.blockCount = 32U;
 * flwConfiguration.arrayBaseAddr = 0xXXXXXXXX;
 * TRDC_SetIDAU(TRDC, &flwConfiguration);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param flwConfiguration Pointer to the configuration structure.
 */
void TRDC_SetFlashLogicalWindow(TRDC_Type *base, const trdc_flw_config_t *flwConfiguration);
/* @} */

/*!
 * @name Domain error check and clear
 * @{
 */
/*!
 * @brief Gets and clears the first domain error of the current domain.
 *
 * This function gets the first access violation information for the current domain
 * and clears the pending flag. There might be multiple access violations pending
 * for the current domain. This function only processes the first error.
 *
 * @param base TRDC peripheral base address.
 * @param error Pointer to the error information.
 * @return If the access violation is captured, this function returns the kStatus_Success.
 *         The error information can be obtained from the parameter error. If no
 *         access violation is captured, this function returns the kStatus_NoData.
 */
status_t TRDC_GetAndClearFirstDomainError(TRDC_Type *base, trdc_domain_error_t *error);

/*!
 * @brief Gets and clears the first domain error of the specific domain.
 *
 * This function gets the first access violation information for the specific domain
 * and clears the pending flag. There might be multiple access violations pending
 * for the current domain. This function only processes the first error.
 *
 * @param base TRDC peripheral base address.
 * @param error Pointer to the error information.
 * @param domainId The error of which domain to get and clear.
 * @return If the access violation is captured, this function returns the kStatus_Success.
 *         The error information can be obtained from the parameter error. If no
 *         access violation is captured, this function returns the kStatus_NoData.
 */
status_t TRDC_GetAndClearFirstSpecificDomainError(TRDC_Type *base, trdc_domain_error_t *error, uint8_t domainId);
/* @} */

/*!
 * @name MRC configuration
 * @{
 */
/*!
 * @brief Sets the TRDC MRC(Memory Region Checkers) global valid.
 *
 * Once enabled, it will remain enabled until next reset.
 *
 * @param base TRDC peripheral base address.
 */
static inline void TRDC_SetMrcGlobalValid(TRDC_Type *base)
{
    base->TRDC_CR |= TRDC_TRDC_CR_GVLDR_MASK;
}

/*!
 * @brief Gets the TRDC MRC(Memory Region Checkers) region number valid.
 *
 * @param base TRDC peripheral base address.
 * @return the region number of the given MRC instance
 */
static inline uint8_t TRDC_GetMrcRegionNumber(TRDC_Type *base, uint8_t mrcIdx)
{
    return ((base->MRC_INDEX[mrcIdx].MRC_GLBCFG & TRDC_MRC_GLBCFG_NRGNS_MASK) >> TRDC_MRC_GLBCFG_NRGNS_SHIFT);
}

/*!
 * @brief Sets the memory access configuration for one of the access control register of one MRC.
 *
 * Example: Enable the secure operations and lock the configuration for MRC0 region 1.
 *
 * @code
 * trdc_memory_access_control_config_t config;
 *
 * config.securePrivX = true;
 * config.securePrivW = true;
 * config.securePrivR = true;
 * config.lock = true;
 * TRDC_SetMrcMemoryAccess(TRDC, &config, 0, 1);
 * @endcode
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to the configuration structure.
 * @param mrcIdx MRC index.
 * @param regIdx Register number.
 */
void TRDC_MrcSetMemoryAccessConfig(TRDC_Type *base,
                                   const trdc_memory_access_control_config_t *config,
                                   uint8_t mrcIdx,
                                   uint8_t regIdx);

/*!
 * @brief Enables the update of the selected domians.
 *
 * After the domians' update are enabled, their regions' NSE bits can be set or clear.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param domianMask Bit mask of the domains to be enabled.
 * @param enable True to enable, false to disable.
 */
void TRDC_MrcEnableDomainNseUpdate(TRDC_Type *base, uint8_t mrcIdx, uint16_t domianMask, bool enable);

/*!
 * @brief Sets the NSE bits of the selected regions for domains.
 *
 * This function sets the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param regionMask Bit mask of the regions whose NSE bits to set.
 */
void TRDC_MrcRegionNseSet(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask);

/*!
 * @brief Clears the NSE bits of the selected regions for domains.
 *
 * This function clears the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param regionMask Bit mask of the regions whose NSE bits to clear.
 */
void TRDC_MrcRegionNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask);

/*!
 * @brief Clears the NSE bits for all the regions of the selected domains.
 *
 * This function clears the NSE bits for all regions of selected domains whose update are enabled.
 *
 * @param base TRDC peripheral base address.
 * @param mrcIdx MRC index.
 * @param domianMask Bit mask of the domians whose NSE bits to clear.
 */
void TRDC_MrcDomainNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t domianMask);

/*!
 * @brief Sets the configuration for one of the region descriptor per domain per MRC instnce.
 *
 * This function sets the configuration for one of the region descriptor, including the start
 * and end address of the region, memory access control policy and valid.
 *
 * @param base TRDC peripheral base address.
 * @param config Pointer to region descriptor configuration structure.
 */
void TRDC_MrcSetRegionDescriptorConfig(TRDC_Type *base, const trdc_mrc_region_descriptor_config_t *config);
/* @} */

/*!
 * @name MBC configuration
 * @{
 */
/*!
 * @brief Sets the TRDC MBC(Memory Block Checkers) global valid.
 *
 * Once enabled, it will remain enabled until next reset.
 *
 * @param base TRDC peripheral base address.
 */
static inline void TRDC_SetMbcGlobalValid(TRDC_Type *base)
{
    base->TRDC_CR |= TRDC_TRDC_CR_GVLDB_MASK;
}

